"use client";
import "./contract.css";
import React, { useState } from "react";

// Existing imports...

export default function Contract() {
  const [accepted, setAccepted] = useState(false);

  const handleAccept = () => {
    setAccepted(!accepted);
  };
  return (
    <div className="flex-auto md:flex-col justify-center items-center h-full gap-6 sm:gap-6 p-10  text-center ">
      <h1 className="p-4 text-[25px] font-bold">สัญญาหอพัก ประจำปี 2566 </h1>
      <div className="Box-Contract bg-white rounded-[20px] border border-black">
        <div className="Box-details text-black text-xs font-normal font-['Poppins'] mb-4 ">
          <div className="text-black text-xs font-bold font-['Poppins'] mb-4 p-1">
            สัญญาเช่าห้องพัก
          </div>
          สัญญานี้ทำขึ้นที่……………………เมื่อวันที่……………………ระหว่าง………………...
          <br />
          ………………………………………อยู่บ้านเลขที่…………………….………………ตำบล/แขวง
          <br />
          …………………………..อำเภอ/เขต………………………..จังหวัด…………………ซึ่งต่อไปใน
          <br />
          สัญญานี้จะเรียกว่า “ผู้ให้เช่า”
          ฝ่ายหนึ่งกับ…………………………….อยู่บ้านเลขที่………………..
          <br />
          ตำบล/แขวง……………………….อำเภอ/เขต…………………………..จังหวัด…………………..
          <br />
          ซึ่งต่อไปในสัญญานี้จะเรียกว่า “ผู้เช่า” อีกฝ่ายหนึ่ง
          <br /> ทั้งสองฝ่ายตกลงทำสัญญากันโดยมีข้อความดังต่อไปนี้
          <br /> ข้อ ๑
          ผู้เช่าตกลงเช่าและผู้ให้เช่าตกลงให้เช่าห้องพักอาศัยห้องเลขที่……………………….
          <br />
          ชั้นที่……….. ของ (ระบุชื่อของอพาร์ตเม้นต์)
          ซึ่งตั้งอยู่ที่……………………………ตำบล/แขวง
          <br />
          …………………….อำเภอ/เขต………………………จังหวัด…………………….…….เพื่อใช้เป็น
          <br />
          ที่พักอาศัย ในอัตราค่าเช่าเดือนละ…………….บาท (…………..……)
          ค่าเช่านี้ไม่รวมถึงค่าไฟฟ้า
          <br />
          ค่าน้ำประปา ค่าโทรศัพท์
          ซึ่งผู้เช่าต้องชำระแก่ผู้ให้เช่าตามอัตราที่กำหนดไว้ในสัญญาข้อ ๔
          <br /> ข้อ ๒ ผู้เช่าตกลงเช่าห้องพักอาศัยตามสัญญาข้อ ๑ มีกำหนดเวลา………ปี
          นับตั้งแต่วัน ที่……………………ถึงวันที่……………………..
          <br /> ข้อ ๓ การชำระค่าเช่า
          ผู้เช่าตกลงจะชำระค่าเช่าแก่ผู้ให้เช่าเป็นการล่วงหน้า
          โดยชำระภายในวันที่…………………..ของทุกเดือนตลอดเวลาอายุการเช่า
          <br /> ข้อ ๔ ผู้ให้เช่าคิดค่าไฟฟ้า ค่าน้ำประปา ค่าโทรศัพท์
          ในอัตราดังนี้
          <br /> (๑) ค่าไฟฟ้ายูนิตละ……………….บาท
          <br /> (๒) ค่าน้ำประปาลูกบาศก์เมตรละ………………….บาท
          <br /> (๓) ค่าโทรศัพท์ (โทร. ออก) ครั้งละ…………………….บาท
          <br /> ข้อ ๕ ผู้เช่าต้องชำระค่าไฟฟ้า ค่าน้ำประปา ค่าโทรศัพท์
          ตามจำนวนหน่วยที่ใช้ในแต่ละเดือนและต้องชำระพร้อมกับการชำระค่าเช่าของเดือนถัดไป
          <br /> ข้อ ๖ เพื่อเป็นการปฏิบัติตามสัญญาเช่า
          ผู้เช่าตกลงมอบเงินประกันแก่ผู้ให้เช่าไว้เป็นจำนวน……………….บาท (………………..)
          เงินประกันนี้ผู้ให้เช่าจะคืนให้แก่ผู้เช่าเมื่อผู้เช่ามิได้
          <br />
          ผิดสัญญา และมิได้ค้างชำระเงินต่างๆ ตามสัญญานี้
          <br /> ข้อ ๗ ผู้เช่าต้องเป็นผู้ชำระเงินค่ากำจัดขยะเดือนละ……………..บาท
          (………………….)
          <br /> ข้อ ๘
          ผู้เช่าต้องเป็นผู้ดูแลรักษาความสะอาดบริเวณทางเดินส่วนกลางหน้าห้องพักอาศัยของผู้เช่า
          และผู้เช่าจะต้องไม่นำสิ่งของใดๆ มาวางไว้ในบริเวณทางเดินดังกล่าว
          <br /> ข้อ ๙ ผู้เช่าต้องดูแลห้องพักอาศัยและทรัพย์สินต่างๆ
          ในห้องพักดังกล่าวเสมือนเป็นทรัพย์สินของตนเอง
          และต้องรักษาความสะอาดตลอดจนรักษาความสงบเรียบร้อย
          ไม่ก่อให้เกิดเสียงให้เป็นที่เดือดร้อนรำคาญแก่ผู้อยู่ห้องพักอาศัยข้างเคียง
          <br /> ข้อ ๑๐ ผู้เช่าต้องเป็นผู้รับผิดชอบในบรรดาความสูญหาย เสียหาย
          หรือบุบสลายอย่างใดๆ อันเกิดแก่ห้องพักอาศัยและทรัพย์สินต่างๆ
          ในห้องพักดังกล่าว
          <br /> ข้อ ๑๑ ผู้เช่าต้องยอมให้ผู้ให้เช่า
          หรือตัวแทนของผู้ให้เช่าเข้าตรวจดูห้องพักอาศัยได้เป็นครั้งคราวในระยะเวลาอันสมควร
          <br /> ข้อ ๑๒ ผู้เช่าต้องไม่ทำการดัดแปลง ต่อเติม
          หรือรื้อถอนห้องพักอาศัยและทรัพย์สินต่างๆ ในห้องพักดังกล่าว
          ไม่ว่าทั้งหมดหรือบางส่วน
          หากฝ่าฝืนผู้ให้เช่าจะเรียกให้ผู้เช่าทำทรัพย์สินดังกล่าวให้กลับคืนสู่สภาพเดิม
          และเรียกให้ผู้เช่ารับผิดชดใช้ค่าเสียหายอันเกิดความสูญหาย เสียหาย
          หรือบุบสลายใดๆ อันเนื่องมาจากการดัดแปลง ต่อเติม หรือรื้อถอนดังกล่าว
          <br /> ข้อ ๑๓
          ผู้เช่าต้องไม่นำบุคคลอื่นนอกจากบุคคลในครอบครัวของผู้เช่าเข้ามาพักอาศัยในห้องพักอาศัย
          <br /> ข้อ ๑๔
          ผู้เช่าสัญญาว่าจะปฏิบัติตามระเบียบข้อบังคับของอพาร์ตเม้นต์ท้ายสัญญานี้
          ซึ่งคู่สัญญาทั้งสองฝ่ายให้ถือว่าระเบียบข้อบังคับดังกล่าวเป็นส่วนหนึ่งแห่งสัญญาเช่านี้ด้วย
          หากผู้เช่าละเมิดแล้วผู้ให้เช่าย่อมให้สิทธิตามข้อ ๑๗ และข้อ ๑๘
          แห่งสัญญานี้ได้
          <br /> ข้อ ๑๕
          ผู้ให้เช่าไม่ต้องรับผิดชอบในความสูญหายหรือความเสียหายอย่างใดๆ
          อันเกิดขึ้นแก่รถยนต์รวมทั้งทรัพย์สินต่างๆ ในรถยนต์ของผู้เช่า
          ซึ่งได้นำมาจอดไว้ในที่จอดรถยนต์ที่ผู้ให้เช่าจัดไว้ให้
          <br /> ข้อ ๑๖
          ผู้เช่าตกลงว่าการผิดสัญญาเช่าเครื่องเรือนซึ่งผู้เช่าได้ทำไว้กับผู้ให้เช่าต่างหากจากสัญญานี้
          ถือว่าเป็นการผิดสัญญานี้ด้วย และโดยนัยเดียวกัน
          การผิดสัญญานี้ย่อมถือเป็นการผิดสัญญาเช่าเครื่องเรือนด้วย
          <br /> ข้อ ๑๗ หากผู้เช่าประพฤติผิดสัญญาข้อหนึ่งข้อใด หรือหลายข้อก็ดี
          ผู้เช่าตกลงให้ผู้ให้เช่าใช้สิทธิดังต่อไปนี้
          ข้อใดข้อหนึ่งหรือหลายข้อรวมกันก็ได้ คือ
          <br /> (๑) บอกเลิกสัญญาเช่า
          <br /> (๒) เรียกค่าเสียหาย
          <br /> (๓)
          บอกกล่าวให้ผู้เช่าปฏิบัติตามข้อกำหนดในสัญญาภายในกำหนดเวลาที่ผู้ให้เช่าเห็นสมควร
          <br /> (๔) ตัดกระแสไฟฟ้า น้ำประปา และโทรศัพท์ ได้ในทันที
          โดยไม่จำเป็นต้องบอกกล่าวแก่ผู้เช่าเป็นการล่วงหน้า
          <br /> ข้อ ๑๘ ในกรณีที่สัญญาเช่าระงับสิ้นลง ไม่ว่าด้วยเหตุใดๆ ก็ตาม
          ผู้เช่าต้องส่งมอบห้อง พักอาศัยคืนแก่ผู้ให้เช่าทันที
          หากผู้เช่าไม่ปฏิบัติ
          ผู้ให้เช่าสิทธิกลับเข้าครอบครองห้องพักอาศัยที่ให้เช่าและขนย้ายบุคคลและทรัพย์สินของผู้เช่าออกจากห้องพักดังกล่าวได้
          โดยผู้เช่าเป็นผู้รับผิดชอบในความสูญหายหรือความเสียหายอย่างใดๆ
          อันเกิดขึ้นแก่ทรัพย์สินของผู้เช่า
          ทั้งผู้ให้เช่ามีสิทธิริบเงินประกันการเช่า ตามที่ระบุไว้ในสัญญาข้อ ๖
          ได้ด้วย
          <br /> ข้อ ๑๙ ในวันทำสัญญานี้
          ผู้เช่าได้ตรวจดูห้องพักอาศัยที่เช่าตลอดจนทรัพย์สินต่างๆ
          ในห้องพักดังกล่าวแล้วเห็นว่ามีสภาพปกติทุกประการ
          และผู้ให้เช่าได้ส่งมอบห้องพักอาศัยและทรัพย์สินต่างๆ
          ในห้องพักแก่ผู้เช่าแล้ว
          <br />{" "}
          คู่สัญญาได้อ่านและเข้าใจข้อความในสัญญานี้โดยตลอดแล้วเห็นว่าถูกต้อง
          จึงได้ลงลายมือชื่อไว้เป็นสำคัญต่อหน้าพยาน
          <br />
          ลงชื่อ..........................................ผู้เช่า
          <br />
          (..........................................)
          <br />
          ลงชื่อ............................................ผู้ให้เช่า
          <br />
          (..........................................)
          <br />
          ลงชื่อ............................................พยาน
          <br />
          (..........................................)
          <br />
          ลงชื่อ............................................พยาน
          <br />
          (..........................................)
          <br />
        </div>
      </div>
      <div className="flex justify-between w-full pt-6">
        <label className="flex items-center gap-1 ml-2">
          <input type="checkbox" checked={accepted} onChange={handleAccept} />
          ฉันอ่านแล้วและยอมรับเงื่อนไข
        </label>
        <button
          className={`rounded-xl w-[91px] h-[35px] text-white text-sm ${
            accepted ? "bg-[#E4965D]" : "bg-neutral-700"
          }`}
          disabled={!accepted}
        >
          ยืนยัน
        </button>
      </div>
    </div>
  );
}
